In [5]:
def mySq(x):
    print(x)
    print("-"*50)
    return x**2
def myExp(x, n):
    return x**n

In [8]:
import pandas as pd

df = pd.DataFrame({
    'a': [10,20,30],
    'b': [20,30,40]
})

df['a']**2
df['a'].apply(mySq) #함수적용

10
--------------------------------------------------
20
--------------------------------------------------
30
--------------------------------------------------

0    100
1    400
2    900
Name: a, dtype: int64

In [10]:
df['a'].apply(myExp,n=3) #인수 2개받는 함수 적용
df.apply(myExp,n=3)

       a      b
0   1000   8000
1   8000  27000
2  27000  64000

In [11]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [13]:
def printMe(x):
    print(x)

In [16]:
df.apply(printMe)
df.apply(printMe, axis=0) # 결과동일. axis=0 은 디폴트구나. 열벡터단위 : (세로방향)
df.apply(printMe, axis=1) # axis=1 행벡터단위 : (가로방향)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [19]:
def myAvg(x,y,z):
    return (x+y+z)/3

#df.apply(myAvg) : 에러남

In [21]:
def myAvg2(data):
    x = data[0]
    y = data[1]
    z = data[2]
    #print("-"*50)
    return (x+y+z)/3

df.apply(myAvg2) #에러안남 [10]의 apply와 헷갈리지 말기.

a    20.0
b    30.0
dtype: float64

In [23]:
import seaborn as sns

titanic = sns.load_dataset("titanic")
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [33]:
import numpy as np

def countMissing(v):
    nullCount = np.sum(pd.isnull(v))
    return nullCount

In [29]:
#eㅔ이타 뿌레임
#벡터화연산

titanic.apply(countMissing) #열벡터단위로 countMissing 의 v에 전달

0
0
0
177
0
0
0
2
0
0
0
688
2
0
0

survived       None
pclass         None
sex            None
age            None
sibsp          None
parch          None
fare           None
embarked       None
class          None
who            None
adult_male     None
deck           None
embark_town    None
alive          None
alone          None
dtype: object

In [31]:
def propMissing(v):
    n = countMissing(v) #null의 갯수 전달
    return n/v.size #null의갯수/벡터의 전체크기

In [35]:
titanic.apply(countMissing)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [34]:
titanic.apply(propMissing) #열벡터단위로 missig데이터의 비율이 나온다.

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [36]:
titanic.apply(propMissing, axis=1) #행벡터단위로 missig데이터의 비율이 나온다.

0      0.066667
1      0.000000
2      0.066667
3      0.000000
4      0.066667
         ...
886    0.066667
887    0.000000
888    0.133333
889    0.000000
890    0.066667
Length: 891, dtype: float64

In [37]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [39]:
titanic["numMissing"] = titanic.apply(countMissing, axis=1)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,numMissing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1

In [46]:
#'numMissing'값이 2이상인 행을 전부 출력
titanic[titanic['numMissing']>1]
titanic[titanic['numMissing']>1].shape #(행,열)갯수정보
#그중에 랜덤하게 10건만 출력하고 시퍼.
titanic[titanic['numMissing']>1].sample(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,numMissing
793,0,1,male,NaN,0,0,30.6958,C,First,man,True,NaN,Cherbourg,no,True,2
330,1,3,female,NaN,2,0,23.2500,Q,Third,woman,False,NaN,Queenstown,yes,False,2
64,0,1,male,NaN,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True,2
531,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,2
409,0,3,female,NaN,3,1,25.4667,S,Third,woman,False,NaN,Southampton,no,False,2
538,0,3,male,NaN,0,0,14.5000,S,Third,man,True,NaN,Southampton,no,True,2
277,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True,2
511,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
629,0,3,male,NaN,0,0,7.7333,Q,Third,man,True,NaN,Queenstown,no,True,2
648,0,3,male,NaN,0,0,7.5500,S,Third,man,True,NaN,Southampton,no,True,2

In [48]:
tips = sns.load_dataset('tips')
tips.sample(10)

     total_bill   tip     sex smoker   day    time  size
73        25.28  5.00  Female    Yes   Sat  Dinner     2
97        12.03  1.50    Male    Yes   Fri  Dinner     2
152       17.26  2.74    Male     No   Sun  Dinner     3
188       18.15  3.50  Female    Yes   Sun  Dinner     3
38        18.69  2.31    Male     No   Sat  Dinner     3
27        12.69  2.00    Male     No   Sat  Dinner     2
186       20.90  3.50  Female    Yes   Sun  Dinner     3
10        10.27  1.71    Male     No   Sun  Dinner     2
87        18.28  4.00    Male     No  Thur   Lunch     2
234       15.53  3.00    Male    Yes   Sat  Dinner     2

In [49]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB

In [50]:
tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [55]:
tips['sex_str'] = tips['sex'].astype(str) #category형을 문자형(object)으로 바꿈
tips.dtypes
tips['total_bill'] = tips['total_bill'].astype(str)
tips.dtypes
tips['total_bill'] = tips['total_bill'].astype(float)
tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
sex_str         object
dtype: object

In [58]:
tipsEx = tips.head(10)
tipsEx

   total_bill   tip     sex smoker  day    time  size sex_str
0       16.99  1.01  Female     No  Sun  Dinner     2  Female
1       10.34  1.66    Male     No  Sun  Dinner     3    Male
2       21.01  3.50    Male     No  Sun  Dinner     3    Male
3       23.68  3.31    Male     No  Sun  Dinner     2    Male
4       24.59  3.61  Female     No  Sun  Dinner     4  Female
5       25.29  4.71    Male     No  Sun  Dinner     4    Male
6        8.77  2.00    Male     No  Sun  Dinner     2    Male
7       26.88  3.12    Male     No  Sun  Dinner     4    Male
8       15.04  1.96    Male     No  Sun  Dinner     2    Male
9       14.78  3.23    Male     No  Sun  Dinner     2    Male

In [68]:
tipsEx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  10 non-null     object
 1   tip         10 non-null     float64
 2   sex         10 non-null     category
 3   smoker      10 non-null     category
 4   day         10 non-null     category
 5   time        10 non-null     category
 6   size        10 non-null     int64
 7   sex_str     10 non-null     object
dtypes: category(4), float64(1), int64(1), object(2)
memory usage: 968.0+ bytes

In [70]:
#tipsEx['total_bill'] = tipsEx['total_bill'].astype(str) #이거 안해도 열 자료형이 missing 넣는순간 object로 다 바뀜
tipsEx.iloc[[range(1,8,2)],0] = "missing"
tipsEx
tipsEx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  10 non-null     object
 1   tip         10 non-null     float64
 2   sex         10 non-null     category
 3   smoker      10 non-null     category
 4   day         10 non-null     category
 5   time        10 non-null     category
 6   size        10 non-null     int64
 7   sex_str     10 non-null     object
dtypes: category(4), float64(1), int64(1), object(2)
memory usage: 968.0+ bytes

In [71]:
tipsEx['total_bill'] = tipsEx['total_bill'].astype(float) #당연히 오류남 : missing이 들어가 있어서

ValueError: could not convert string to float: 'missing'

In [75]:
tipsEx['total_bill'] = pd.to_numeric(tipsEx['total_bill'], errors='ignore')
tipsEx
tipsEx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  10 non-null     object
 1   tip         10 non-null     float64
 2   sex         10 non-null     category
 3   smoker      10 non-null     category
 4   day         10 non-null     category
 5   time        10 non-null     category
 6   size        10 non-null     int64
 7   sex_str     10 non-null     object
dtypes: category(4), float64(1), int64(1), object(2)
memory usage: 968.0+ bytes

In [77]:
tipsEx['total_bill'] = pd.to_numeric(tipsEx['total_bill'], errors='coerce') #missing 을 nan으로 바꿔줌!
tipsEx.info()
tipsEx

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  6 non-null      float64
 1   tip         10 non-null     float64
 2   sex         10 non-null     category
 3   smoker      10 non-null     category
 4   day         10 non-null     category
 5   time        10 non-null     category
 6   size        10 non-null     int64
 7   sex_str     10 non-null     object
dtypes: category(4), float64(2), int64(1), object(1)
memory usage: 968.0+ bytes

   total_bill   tip     sex smoker  day    time  size sex_str
0       16.99  1.01  Female     No  Sun  Dinner     2  Female
1         NaN  1.66    Male     No  Sun  Dinner     3    Male
2       21.01  3.50    Male     No  Sun  Dinner     3    Male
3         NaN  3.31    Male     No  Sun  Dinner     2    Male
4       24.59  3.61  Female     No  Sun  Dinner     4  Female
5         NaN  4.71    Male     No  Sun  Dinner     4    Male
6        8.77  2.00    Male     No  Sun  Dinner     2    Male
7         NaN  3.12    Male     No  Sun  Dinner     4    Male
8       15.04  1.96    Male     No  Sun  Dinner     2    Male
9       14.78  3.23    Male     No  Sun  Dinner     2    Male

In [79]:
tips['smoker'] = tips['smoker'].astype('str')
tips.info()
tips['smoker'] = tips['smoker'].astype('category')
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    object
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   sex_str     244 non-null    object
dtypes: category(3), float64(2), int64(1), object(2)
memory usage: 10.7+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   sex_str     244 non-null    object
dtypes: category(4), float64(2), int64(1), object(1)
memory usage: 9.2+ KB

In [81]:
df = pd.read_csv("../data2/gapminder.tsv", sep="\t")
df.sample(10)

            country continent  year  lifeExp        pop      gdpPercap
1152           Oman      Asia  1952   37.578     507833    1828.230307
682         Hungary    Europe  2002   72.590   10083313   14843.935560
708       Indonesia      Asia  1952   37.468   82052000     749.681655
346     Congo, Rep.    Africa  2002   52.970    3328795    3484.061970
598          Greece    Europe  2002   78.256   10603863   22514.254800
1537           Togo    Africa  1957   41.208    1357445     925.908320
1617  United States  Americas  1997   76.810  272911760   35767.433030
852          Kuwait      Asia  1952   55.565     160000  108382.352900
1117          Niger    Africa  1957   38.598    3692184     835.523403
198    Burkina Faso    Africa  1982   48.122    6634596     807.198586

In [85]:
df.groupby("year")["lifeExp"].mean()
df.groupby("year").lifeExp.mean() #같은결과

aleby = df.groupby("year")["lifeExp"].mean()

In [90]:
#df에서 year를 중복제거하고 추출
df['year'].unique()
set(df.year)

{1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002, 2007}

In [96]:
#df에서 year가 1952년도인 모든 자료 출력
df[df['year'] == 1952]
df.loc[df['year'] == 1952]
df.loc[df['year'] == 1952,:]

y1952 = df[df['year'] == 1952]

#1952년의 lifeExp 칼럼의 평균을 출력하세요
y1952['lifeExp'].mean()
y1952.lifeExp.mean()

y1952Mean = y1952.lifeExp.mean()

In [97]:
y1957 = df[df['year'] == 1957]
y1957Mean = y1957.lifeExp.mean()
y1962 = df[df['year'] == 1962]
y1962Mean = y1962.lifeExp.mean()
y2007 = df[df['year'] == 2007]
y2007Mean = y2007.lifeExp.mean()

In [99]:
pd.DataFrame({
    'year':[1952,1957,1962,2007],
    'avg':[y1952Mean, y1957Mean, y1962Mean, y2007Mean]
})

   year        avg
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [100]:
def myMean(v):
    n = len(v)
    s = 0
    for value in v:
        s+=value
    return s/n

In [110]:
#연도 단위로 기대수명치의 평균 출력(myMean함수사용)
df.groupby('year').lifeExp.apply(myMean)
df.groupby('year').lifeExp.agg(myMean)
#agg함수의 활용
df.groupby('year').lifeExp.agg(np.mean)
df.groupby('year').lifeExp.agg([np.mean])
df.groupby('year').lifeExp.agg([np.mean, np.std, np.count_nonzero])

           mean        std  count_nonzero
year
1952  49.057620  12.225956          142.0
1957  51.507401  12.231286          142.0
1962  53.609249  12.097245          142.0
1967  55.678290  11.718858          142.0
1972  57.647386  11.381953          142.0
1977  59.570157  11.227229          142.0
1982  61.533197  10.770618          142.0
1987  63.212613  10.556285          142.0
1992  64.160338  11.227380          142.0
1997  65.014676  11.559439          142.0
2002  65.694923  12.279823          142.0
2007  67.007423  12.073021          142.0